import React, { useState } from 'react';
import styled from 'styled-components';

const RegulationPage = () => {
  const [isAccepted, setIsAccepted] = useState(false);

  const handleAccept = () => {
    setIsAccepted(true);
  };

  return (
    <TermsContainer >
      <h1>תקנון האתר (תקנון – אחריות ותנאים כלליים)</h1>
      <section className="terms-content">
        <h2>כללי</h2>
        <ol>
          <li>העסק – "dani riggs yoga" – (להלן: "העסק" ).</li>
          <li>הכתוב בתקנון האתר חל על כל גולש/ת באתר, והשימוש בלשון זכר הוא מטעמי נוחות בלבד.</li>
          <li>השימוש באתר, לרבות רכישת כרטיסים לאירועים באמצעות האתר, אסורה למי שטרם מלאו לו 18 שנים, ו/או למי שאינו כשיר לבצע פעולות משפטיות מחייבות.</li>
          <li>לעסק הזכות לשנות את תנאי השימוש בתקנון זה, בכל עת ולפי שיקול דעתו הבלעדית, ללא צורך במתן התראה ו/או הודעה מוקדמת. שינוי כאמור מחייב את הצדדים מרגע פרסומו ו/או עדכונו בתקנון זה.</li>
          <li>התקנון ותנאי השימוש חלים על כל שימוש שנעשה באתר בכל צורה שהיא, באמצעות מחשב, מחשב כף יד, מכשיר סלולארי לרבות כל מכשיר אחר.</li>
          <li>הזמנת מקום, מהווה הסכמה לכל התנאים וההגבלות המפורטים בתקנון זה.</li>
          <li>המשתמש באתר מסכים כי לא תהיה לו או למי מטעמו כל טענה ו/או דרישה כלפי העסק בגין שינויים של האתר, לרבות תכניו, ו/או תקלות שעלולות להתרחש כתוצאה משימוש באתר.</li>
          <li>השימוש באתר על ידי המשתמש, מהווה הצהרה כי המשתמש קרא ומאשר את התקנון ואת תנאי השימוש באתר זה, ולא תהיה לו ו/או למי מטעמו כל תביעה, טענה או דרישה כנגד העסק ו/או האתר. המתנגד לתקנון זה מתבקש לא להשתמש באתר, לרבות רכישת כרטיסים לאירועים באמצעותו.</li>
          <li>אין באמור בתקנון זה כדי לגרוע מהוראות חוק הגנת הצרכן, התשמ"א-1981 (להלן: "חוק הגנת הצרכן"), והתקנות אשר הותקנו מכוחו, ככל שהן חלות על האתר, למעט במקרים בהם ניתן להתנות על הוראות כאמור, והתניה כאמור בוצעה במסגרת פעילות האתר, אם במפורש או במשתמע.</li>
          <li>ביצוע הזמנה ו/או רכישה של מקום כפוף לכל הוראותיו ותנאיו של תקנון זה, ובכפוף לאמור בכל דין. לא תהיה למשתמש ו/או למי מטעמו כל טענה ו/או דרישה ו/או תביעה כנגד האתר ו/או העסק בכל הקשור להוראות והתנאים של תקנון זה.</li>
        </ol>

        <h2>קיום האירועים</h2>
        <ol>
          <li>קיום האירועים מותנים במינימום משתתפים. המארגנים שומרים לעצמם את הזכות לבטל את האירוע במידה וכמות הנרשמים לא תגיע למינימום הנדרש. במקרה כזה תישלח הודעה לכל אחד מהנרשמים ויוחזר להם הסכום ששלמו עבור האירוע במלואו בתוך 5 ימים מקבלת ההודעה.</li>
          <li>המארגנים שומרים לעצמם את הזכות לסרב להמשך השתתפות של אדם באירוע במידה והתנהגותו פוגעת או מפריעה למשתתפים האחרים. אדם כזה יידרש לעזוב את המקום לאלתר ולא יהיה זכאי להחזר כספי כל שהוא.</li>
          <li>המשתתפים אחראים לשמור על חפציהם האישיים לאורך כל האירוע. המארגנים לא יהיו אחראים לאובדן או גניבה של חפצים אישיים של המשתתפים באירוע.</li>
          <li>הפסקת ההשתתפות באירוע ביוזמת המשתתף, מכל סיבה שהיא לא תזכה את המשתתף בהחזר כספי.</li>
          <li>במקרה של סגר או הנחיות פיקוד העורף שלא יאפשרו את קיומו של האירוע, האירוע יבוטל והמשתתפים יקבלו בחזרה את הסכום ששילמו במלואו</li>
          <li>ההשתתפות באירועים השונים היא באחריות המשתתפים ובהתאמה למצבם הבריאותי כפי שהם מצהירים עליו להלן.</li>
          <li>הצהרת בריאות: לפני ביצוע רישום לריטריט, יש לחתום דיגיטלית על הצהרת הבריאות. הפקת הריטריט מסירה מעצמה כל אחריות ממשתתפות שהגיעו ואינן חתומות על טופס הצהרת הבריאות. עלייך ליידע מראש את הצוות אם ישנם סיכונים כלשהם לבריאותך על ידי השתתפות בריטריט לרבות אם יש לך פציעה קיימת, מחלה, כאבי שרירים, אי נוחות או בהריון.</li>
          <li>בכל מקרה של שינוי בתוכנית בשל גורמים שאינם בשליטת המארגנים (כגון: מדריך/מרצה חולה, אתר סגור וכד'), המארגנים יפעלו כמיטב יכולתם להשגת חלופה הולמת.</li>
          <li>קוד התנהגות: ההשתתפות בריטריט מותנית בהתנהגות נאותה ומכבדת כלפי הצוות, המקום, והמשתתפים האחרים, תוך התחשבות בפרטיות המשתתפים ושמירה על הסביבה והניקיון.</li>
          <li>במידה והביטול אינו עומד בתנאים של חוק הגנת הצרכן, יחולו על הצרכן דמי הביטול כמפורט להלן:</li>
          <p>מ-20 יום ועד 11 יום לפני האירוע – ייגבה סכום של 25% ממחיר ההזמנה.</p>
          <p>מ-10 ועד 3 ימים לפני האירוע – ייגבה סכום של 50% ממחיר ההזמנה</p>
          <p>פחות מ-3 ימים לפני האירוע – לא יהיה החזר. </p>
          <li> העסק הינו בעל זכויות היוצרים באתר, לרבות שמו, תכניו, עיצובו, וכל תוכן אחר שבאתר המשמש לפעילותו.</li>
          <li>כל המידע ו/או התכנים המופיעים באתר, לרבות עיצובים, איורים וכדומה, הינם רכושו הבלעדי של העסק ו/או האתר, אין להעתיק, לצלם, להפיץ, להציג בפומבי או למסור לצד שלישי אחד מאלו.</li>
          <li> השימוש במידע: המידע האישי ישמש לצורכי זיהוי, יצירת קשר והפעלה של הריטריט בלבד. לא ייעשה כל שימוש אחר במידע שנמסר, ולא יועבר לצד שלישי כל מידע אישי, אלא אם יחויב האתר לעשות זאת על פי חוק או על פי בקשתך המפורשת.</li>
          <li>ניתן ליצור קשר עם העסק / האתר באמצעים הבאים :</li>
          <p>במייל: dcriggs2202@gmail.com </p>
          <p>בטלפון: 054-2029014</p>
          
          
        </ol>
        
      </section>
    </TermsContainer>
  );
};


const TermsContainer = styled.div`
direction: rtl;
text-align:right;

`
export default RegulationPage;
