{
    "about": {
        "text": "זה קצת מוזר לרשום פה כי אני מה זה לא אוביייקטיבית, אבל בגדול הגעתם למקום הכי טוב בעולם שנקרא יוגה טרללה ובשמו המלא דוקטור פאוור יוגה. אז בגדול דני היא מורה ליוגה טרללה ומנהיגת הכת הכי לא כתית בעולם. ולא, היא לא שמן זית. דני היא גם אחותו של  מגייק מייק שהוא חיים בלב ולב אחד גדול. ושוב זה מאוד מוזר לרשום פה. פעם דני גם היתה עובדת סוציאלית אבל אי אפשר לקנות סוכר בסופר עם המשכורת שלהם אלו (שזה מעולה כי זה מה זה לא בריא) אז היא הלכה לתמוך נפשית בנשים בזמן שהיא הופכת אותם ליותר נשיות בזמן שיא והן קצת חופרות לה אז אם תראו אותה אחרי יום עבודה אנא תיהיו רכים איתה.  אז בגדול היוגה פה היא לא יוגה רגילה, נראה לי שזה רק תירוץ למרות שהיא מעולה והפינצה לי השתפרה פלאים והכתפיים שלי אשכרה הולכות אחורה בעצמם וואו טירוף הטירופים. ומצד שני לפעמים אני אומרת לעצמי וואלה לא נרשמתי לחוג הזה מה נסגר איתה הגוף שלי לא בנוי לדברים האלה אני רוצה הביתה למרות שבא לי להתנחל לה בסטודיו ואני מתנחלת לשעבר וזה מאוד קשה ללכת. אני סוטה מהנושא סליחה אני לא מרוכזת.",
        "secondery_text": "",
        "extra_title": "ABOUT ME",
        "title": "Yoga for the community"
    },
    "points": [
        "השיעורים הכי טובים בעולם דה",
        "לפעמים תרצו להתקשר לאמא לבכות לה",
        "וואלה לא בא לי להיות רצינית כרגע",
        "רק שתדעו שזה כמו חוג למבוגרים ואני סוג של גזברית"
    ],
    "studio": {
        "text": "טוב מה אפשר לרשום על המקום הכי טוב בעולם? דם ויזע יצאו עליו כדי להפוך אותו למה שהוא היום רק שתדעוווווווו והיא גרה בקומה שלישית והיתה צריכה לקנות טלוויזיה חדשה אבל יש בו משהו אחר הסטודיו הזה זה קסם ז אווירה זה פשוט בית זה שעה וחצי של ניתוק מהעולם החיצון ",
        "title": "The studio",
        "points": [
            "בשמים זוקחת שמש ואני מצייר עננים",
            "ניננניננינ גם אנחנו היינו קטנים",
            "יופי ניצול מאוד מוצלח של חולי"
        ],
        "images": [
            {
                "name": "dani3.jpg",
                "xs": 11
            },
            {
                "name": "studio1.jpg",
                "xs": 5
            },
            {
                "name": "studio2.jpg",
                "xs": 6
            }
        ]
    },
    "yoga_event": {
        "text": "אני וצה להודות לפח שאפשר לי להשתתף באירועי היוגה בתקופה האחרונה , תודה רבה על הצל המסור שסיפקת לי והריח הנהדר שחלקת עימי, זו היתה תקופה נהדרת ואנצור אותה בליבי לעד, יהיה שלום פחוש נתראה בקיץ הבא",
        "secondery_text": "מה זה שיעור יוגה? זה מטוס? זה ציפור? לא זה אירוע יוגה",
        "title": "Yoga event",
        "images": [
            {
                "name": "yogaEvent2.jpg",
                "xs": 6
            },
            {
                "name": "yogaEvent6.png",
                "xs": 6
            },
            {
                "name": "yogaEvent5.png",
                "xs": 6
            },
            {
                "name": "yogaEvent3.jpg",
                "xs": 6
            }
        ]
    },
    "retreat": {
        "text": "מה אגיד מה אגיד על הסופשים הכי טובים בעולםםם הזהההההה ועמכם הסליחה זה מאוד קשה לעשות ריטריט בארץ מאז שאי אפשר לנסוע לעבדללה למרות שאני אשמח בכיף ובשמחה לארגן הכל אממ אממ ואנשים גם ככה ילכו לאיפה שאת תלכי כי את את ואז אופס יש לנו ריטריט ",
        "title": "Retreats",
        "images": [
            {
                "name": "dani3.jpg",
                "xs": 5
            },
            {
                "name": "studio1.jpg",
                "xs": 6
            },
            {
                "name": "studio2.jpg",
                "xs": 3
            },
            {
                "name": "yogaEvent3.jpg",
                "xs": 4
            },
            {
                "name": "yogaEvent4.jpg",
                "xs": 4
            }
        ]
    },
    "content_creator": {
        "text": "סליחה אבל מעט מאוד כמעט אפילו מעולם לא ראיתי רילסים יותר טובים ושלא נדבר על יכולת הצילום והמסירות לתפקיד",
        "title": "Content creator",
        "videos": [
            "./src/assets/images/editor.mov",
            "https://www.w3schools.com/html/movie.mp4",
            "https://www.w3schools.com/html/mov_bbb.mp4"
        ]
    },
    "cardsDescription": [
        {
            "image": "yoga1.jpg",
            "description": "מחשבות רבות"
        },
        {
            "image": "studio2.jpg",
            "description": "אני צריכה לסדר את הדירה ולהכין צהריים"
        },
        {
            "image": "yogaEvent3.jpg",
            "description": "סופש מקסים כיף להיות חולה"
        }
    ],
    "next_events": {
        "text": "Comming soon...",
        "title": "Next events"
    }
}